In [2]:
import pandas as pd

In [ ]:
import warnings 
warnings.filterwarnings('ignore')

In [3]:
data={
    "Name":["A","B","C","D","E","F"],
    "Age":[25,30,35,40,45,50]
}
df=pd.DataFrame(data,index=[0,1,1,2,2,2])
df

  Name  Age
0    A   25
1    B   30
1    C   35
2    D   40
2    E   45
2    F   50

## reset index

In [4]:
df_reset=df.reset_index(drop=True)
df_reset

  Name  Age
0    A   25
1    B   30
2    C   35
3    D   40
4    E   45
5    F   50

## keep="first"

In [5]:
df_unique=df[df.index.duplicated()]
df_unique

  Name  Age
1    C   35
2    E   45
2    F   50

In [8]:

# drop duplicate index rows (keep first occurence)
df_unique=df[~df.index.duplicated(keep="first")]
df_unique

  Name  Age
0    A   25
1    B   30
2    D   40

# keep="last"Â¶

In [10]:
# drop duplicate index rows (keep last occurence)
df_unique=df[~df.index.duplicated(keep="last")]
df_unique

  Name  Age
0    A   25
1    C   35
2    F   50

# keep="False"

In [11]:
# drop all rows with duplicates 
df_unique=df[~df.index.duplicated(keep=False)]
df_unique

  Name  Age
0    A   25

 ## methods to select a cell /data frame indexing

In [12]:
df=pd.DataFrame({
    "Name":["Ram","Sita","Ravi"],
    "Marks":[85,90,78],
    "City":["Delhi","Mumbai","Chennai"]
},index=[101,102,103])
df

     Name  Marks     City
101   Ram     85    Delhi
102  Sita     90   Mumbai
103  Ravi     78  Chennai

### loc[rowlabel,collabel]

In [15]:
print(df.loc[102,"Marks"])
print(df.loc[103,"City"])

90
Chennai

## iloc[row_indx,col_index]

In [18]:
print(df.iloc[1,1])
print(df.iloc[0,2])
print(df.iloc[2,0])

90
Delhi
Ravi

 ## at[row_label,col_label]

In [20]:
print(df.at[101,"Marks"])
print(df.at[102,"City"])

85
Mumbai

## iat[row_label,col_label]

In [21]:
print(df.iat[1,1])
print(df.iat[0,2])
print(df.iat[2,0])

90
Delhi
Ravi

In [24]:
## xs---->cross section
print(df.xs(102))

Name       Sita
Marks        90
City     Mumbai
Name: 102, dtype: object

In [25]:
df["Name"]

101     Ram
102    Sita
103    Ravi
Name: Name, dtype: object

In [29]:
print(df[df["Marks"]>80])

     Name  Marks    City
101   Ram     85   Delhi
102  Sita     90  Mumbai

In [31]:
df.loc[102:103]

     Name  Marks     City
102  Sita     90   Mumbai
103  Ravi     78  Chennai

In [32]:
df.iloc[1:2]

     Name  Marks    City
102  Sita     90  Mumbai

## Group by(),Agg()

In [33]:
data={
    "Empid":[1,2,3,4,5,6],
    "Name":["A","B","C","D","E","F"],
    "Department":["Sales","HR","Sales","IT","HR","IT"],
    "Salary":[50000,60000,50000,70000,60000,70000]
}
df=pd.DataFrame(data)
df

   Empid Name Department  Salary
0      1    A      Sales   50000
1      2    B         HR   60000
2      3    C      Sales   50000
3      4    D         IT   70000
4      5    E         HR   60000
5      6    F         IT   70000

In [34]:
summary=df.groupby("Department").agg(
    Avg_Salary=("Salary","mean"),
    Total_salary =("Salary","sum"),
    Employee_count=("Empid","count")
)
summary

            Avg_Salary  Total_salary  Employee_count
Department
HR             60000.0        120000               2
IT             70000.0        140000               2
Sales          50000.0        100000               2

In [35]:
# find maximum salary per department
max_salary=df.groupby("Department")["Salary"].max()
max_salary

Department
HR       60000
IT       70000
Sales    50000
Name: Salary, dtype: int64

In [36]:
# find minimum salary per department
mix_salary=df.groupby("Department")["Salary"].min()
max_salary

Department
HR       60000
IT       70000
Sales    50000
Name: Salary, dtype: int64

In [37]:
multi=df.groupby("Department")["Salary"].agg(
    ['mean','sum','min','max','count','median']
)
multi

               mean     sum    min    max  count   median
Department
HR          60000.0  120000  60000  60000      2  60000.0
IT          70000.0  140000  70000  70000      2  70000.0
Sales       50000.0  100000  50000  50000      2  50000.0

In [38]:
a=df.groupby(["Department","Salary"]).size()
a

Department  Salary
HR          60000     2
IT          70000     2
Sales       50000     2
dtype: int64

In [42]:
data={
    "OrderID":[1,2,3,4,5,6],
    "Region":["east","west","east","south","west","east"],
    "Produt":["laptop","mobile","laptop","tablet","laptop","mobile"],
    "Sales":[800,500,900,700,1200,400]
}
df=pd.DataFrame(data)
df
#total sales by a region
#Average sales by product
#count of ordrs per region

   OrderID Region  Produt  Sales
0        1   east  laptop    800
1        2   west  mobile    500
2        3   east  laptop    900
3        4  south  tablet    700
4        5   west  laptop   1200
5        6   east  mobile    400

## multidimenstional aggregation using pivot table()

In [2]:
import pandas as pd

In [6]:
data={
    "Region":["East","East","East","East","West","West","West","West","South","South","South","South"],
    "Product":["Laptop","Laptop","Mobile","Mobile","Laptop","Laptop","Tablet","Tablet","Mobile","Mobile","Tablet","Tablet"],
    "Sales":[800,500,600,400,1000,700,500,300,650,550,450,350],
    "Quantity":[5,3,4,2,6,4,3,2,5,3,4,2]
}
df=pd.DataFrame(data)
df

   Region Product  Sales  Quantity
0    East  Laptop    800         5
1    East  Laptop    500         3
2    East  Mobile    600         4
3    East  Mobile    400         2
4    West  Laptop   1000         6
5    West  Laptop    700         4
6    West  Tablet    500         3
7    West  Tablet    300         2
8   South  Mobile    650         5
9   South  Mobile    550         3
10  South  Tablet    450         4
11  South  Tablet    350         2